In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
df = pd.read_csv("CT-2_HSC-1st Year-Science_2024-2025(Sheet1).csv")

In [15]:
df.head()

,Sorted by merit Position,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Sorted by Roll Number,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35,Unnamed: 36,Unnamed: 37,Unnamed: 38,Unnamed: 39,Unnamed: 40,Unnamed: 41
0,Name,Roll No.,Merit,total,gpa,no of failed Subject,Name,Roll No.,Merit,total,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NAHIYAN AHMED,1202425010019,1,130,5.00,Passed,MD. NAGIB MAHAFUZ,1202425010001,424,89,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,FARSAD BIN HAROUN,1202425010099,2,128,5.00,Passed,MD. SHOYB HASAN,1202425010002,313,97,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MD.ABU JAFOR,1202425010239,3,126,5.00,Passed,SAZID MAHMUD,1202425010003,100,105,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NUR MOHAMMAD KAFI,1202425010767,4,126,5.00,Passed,MD. SAYEED AL JUBAYER,1202425010004,314,97,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
df.columns

Index(['Sorted by merit Position', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3',
       'Unnamed: 4', 'Unnamed: 5', 'Sorted by Roll Number', 'Unnamed: 7',
       'Unnamed: 8', 'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12',
       'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16',
       'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20',
       'Unnamed: 21', 'Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24',
       'Unnamed: 25', 'Unnamed: 26', 'Unnamed: 27', 'Unnamed: 28',
       'Unnamed: 29', 'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32',
       'Unnamed: 33', 'Unnamed: 34', 'Unnamed: 35', 'Unnamed: 36',
       'Unnamed: 37', 'Unnamed: 38', 'Unnamed: 39', 'Unnamed: 40',
       'Unnamed: 41'],
      dtype='object')

In [11]:
head_row = df.iloc[0]

In [12]:
data = df[1:].reset_index(drop=True)

In [14]:
data_1 = data.iloc[:, 0:6].copy()
data_2 = data.iloc[:, 6:12].copy()

In [16]:
data_1.columns = head_row[0:6].values
data_2.columns = head_row[6:12].values

In [17]:
data_1.head()

                 Name       Roll No. Merit total   gpa  no of failed Subject
0       NAHIYAN AHMED  1202425010019     1   130  5.00                Passed
1   FARSAD BIN HAROUN  1202425010099     2   128  5.00                Passed
2        MD.ABU JAFOR  1202425010239     3   126  5.00                Passed
3   NUR MOHAMMAD KAFI  1202425010767     4   126  5.00                Passed
4   NAVO NAJIF SHARIF  1202425010217     5   125  5.00                Passed

In [19]:
data_1.isnull().sum()

Name                     17
Roll No.                 17
Merit                    17
total                    17
gpa                      17
 no of failed Subject    17
dtype: int64

In [20]:
data_1.dropna(how='all', inplace=True)
data_2.dropna(how='all', inplace=True)

In [21]:
data_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 883 entries, 0 to 882
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Name                   883 non-null    object
 1   Roll No.               883 non-null    object
 2   Merit                  883 non-null    object
 3   total                  883 non-null    object
 4   gpa                    883 non-null    object
 5    no of failed Subject  883 non-null    object
dtypes: object(6)
memory usage: 48.3+ KB

In [22]:
data_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 883 entries, 0 to 882
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Name                   883 non-null    object
 1   Roll No.               883 non-null    object
 2   Merit                  883 non-null    object
 3   total                  883 non-null    object
 4   gpa                    883 non-null    object
 5    no of failed Subject  883 non-null    object
dtypes: object(6)
memory usage: 48.3+ KB

In [23]:
data_1.to_csv("data_1.csv", index=False)
data_2.to_csv("data_2.csv", index=False)